===================================
Escaped echo statement
===================================
{{ "hello" }}
---

(document
  (text
    (echo_statement
      (escaped_echo_statement
        (raw_text)))))

===================================
Unescaped echo statement
===================================
{{!! "hello" !!}}
---

(document
  (text
    (echo_statement
      (unescaped_echo_statement
        (raw_text)))))

===================================
Echo statement escaped
===================================
@{{!! "hello" !!}}
---

(document
  (text))

===================================
Echo statement within tags
===================================
<button>{{ "hello" }}</button>
---

(document
  (element
    (start_tag
      (tag_name))
    (text
      (echo_statement
        (escaped_echo_statement
          (raw_text))))
    (end_tag
      (tag_name))))

=============================
Echo statement as attribute
=============================
<button {{ $attributes }}>Test</button>
---

(document
  (element
    (start_tag
      (tag_name)
      (echo_statement
        (escaped_echo_statement
          (raw_text))))
    (text)
    (end_tag
      (tag_name))))

=============================================
Echo statement as attribute value
=============================================
<button class={{ "text-lg" }}>Test</button>
---

(document
  (element
    (start_tag
      (tag_name)
      (attribute
        (attribute_name)
        (attribute_value
          (echo_statement
            (escaped_echo_statement
              (raw_text))))))
    (text)
    (end_tag
      (tag_name))))

=============================================
Echo statement within quoted attribute value
=============================================
<button class="text-sm {{!! "text-lg" !!}} text-xl">Test</button>
---

(document
  (element
    (start_tag
      (tag_name)
      (attribute
        (attribute_name)
        (quoted_attribute_value
          (attribute_value
            (echo_statement
              (unescaped_echo_statement
                (raw_text)))))))
    (text)
    (end_tag
      (tag_name))))

===================================
Blade comment
===================================
{{-- "hello" --}}
---

(document
  (text
    (echo_statement
      (blade_comment))))

===========================
Directive without argument
===========================
@if
---

(document
  (directive))

===========================
Directive escaped
===========================
@@if
---

(document
  (text))

===========================
Directive with argument
===========================
@props(['active' => false])
---

(document
  (directive
    (directive_argument
      (raw_text))))

===========================
Directive as attribute
===========================
<span @class(['p-4'])>Test</span>
---

(document
  (element
    (start_tag
      (tag_name)
      (directive
        (directive_argument
          (raw_text))))
    (text)
    (end_tag
      (tag_name))))

===========================
Expression attributes
===========================
<x-nav-link :active="request()->is('/')">Home</x-nav-link>
---

(document
  (element
    (start_tag
      (tag_name)
      (attribute
        (expression_attribute
          (attribute_name)
          (quoted_attribute_value
            (attribute_value)))))
    (text)
    (end_tag
      (tag_name))))

==============================
Escaped expression attribute
==============================
<x-nav-link ::active="request()->is('/')">Home</x-nav-link>
---

(document
  (element
    (start_tag
      (tag_name)
      (attribute
        (attribute_name)
        (quoted_attribute_value
          (attribute_value))))
    (text)
    (end_tag
      (tag_name))))

=================================
Directive inside attribute value
=================================
<button class="@error('title') is-invalid @enderror"></button>
---

(document
  (element
    (start_tag
      (tag_name)
      (attribute
        (attribute_name)
          (quoted_attribute_value
            (attribute_value
              (directive
                (directive_argument
                  (raw_text)))
              (directive)))))
    (end_tag
      (tag_name))))

=================================
Php directive
=================================
@php
$hello = "test";
$sum = 5 + 3;
@endphp
---

(document
  (directive
    (php_directive
      (raw_text))))
